[
    {
        "position": "Account Executive, Enterprise Upsell",
        "date": "07/2019 - 04/2020",
        "description": "Partnered with four Customer Success Managers to manage and renew enterprise subscriptions. Lead point of contact for growing existing accounts by initiating contact with customers, identifying their needs, and selling appropriate packages to meet those needs.",
        "bullets": [
            "- Won 64% of 2019 enterprise upsell opportunities, resulting in a 152% increase in customer spend. \n",
            "- Closed 75% of RFPs (request for proposal) in 2019, generating net-new revenue for the business. \n",
            "- Renewed 53% churn-risk customers for Q3 and Q4 2019, saving the company significant ARR."
        ]
    },
    
    {
        "position": "Account Executive, Small and Medium-sized Business",
        "date": "04/2019 - 07/2019",
        "description": "Responsible for acquiring net new logos through direct sales of MediaPRO’s SaaS to companies with fewer than 1000 employees across all states west of the Mississippi River.",
        "bullets": [
            "- Achieved 167% quota attainment and 10 new logos my first quarter as an AE Q2 2019."
        ]
    },

    {
        "position": "Strategic Business Development Specialist",
        "date": "10/2018 - 03/2019",
        "description": "Building on prior role success, promoted into this position to own strategy around generating new opportunities for our VP of Sales within our Fortune 100 customer accounts.",
        "bullets": [
            "- Successfully converted 45% of my Q3 and Q4 targeted accounts. \n",
            "- Assisted Enterprise Account Executives with sales cycles such as proposals and procurement process."
        ]
    },

    {
        "position": "Business Development Specialist",
        "date": "06/2018 - 09/2018",
        "description": "Responsible for prospecting and qualifying leads at top of sales funnel. Pass qualified opportunities to one of six Enterprise Account Executives. "
    }
]
